<template>
	<!-- 用户协议  User_agreement -->
	<div class="User_agreement" :style="pageHeight">
		<van-nav-bar title="用户协议"  left-arrow fixed @click-left="onClickLeft" />
		<h3>使用某某APP，需同意《某某用户协议》</h3>
		<p>本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
			本协议适用于某某app服务项目（以下内容简称“某某app”），用户（指有货物运输需求并通过“某某app”应用程序软件（以下简称
		</p>
	</div>
</template>

<script>
	export default {
		data() {
			return {
				pageHeight: {
					height: window.innerHeight + 'px',
					backgroundColor: '#ffffff'
				}
			}
		},
		methods: {
			onClickLeft() {
				this.$router.go(-1);
			}
		}
	}
</script>

<style lang="scss" scoped>
	.User_agreement {
		color: #303030;
		font-size: 14Px;
		padding: 0 15px;
		h3 {
			margin: 0 0 20Px;
			padding-top: 66Px;
		}
	}
</style>
